# Задача 26
# def exponent(a, b):
#      if b==0:
#          return 1
#      return a*exponent(a,b-1)
# a = int(input("Введите число:"))
# b = int(input("Введите степень:"))
# print(exponent(a, b))

# Задача 28
# def sum_rec(a, b):
#     if b == 0:
#         return a
#     elif a == 0:
#         return b
#     return 1 + sum_rec(a, b - 1)
#
#
# a = int(input("Введите первое число:"))
# b = int(input("Введите второе число:"))
# print(sum_rec(a, b))
